
export const defaultLanguage = "markdown"


export const defaultSnippet = `# NoteSnip

This site is **NoteSnip!**

## What's this website?

このウェブサイトは、 _ちょっとしたコード_ を他人と共有できるウェブサイトです。

コードの*文字数が多くても*、大丈夫！
共有するのは __短いURL__ になりますので、文字数が多いコードでも安心。

~~プロジェクト単位のコードは[Github](https://github.co.jp/)や[GitLab](https://about.gitlab.com/)なんかを使ってね！~~

## 使い方

使い方に困ったら、ロゴの隣の**ヘルプボタン**を押してね！
サイトの使い方が出てくるよ！

### 詳しい使い方

1. エディターに**コードを書く**、あるいはエディターに**コードを貼り付けてください**。
2. 書いた、あるいは貼り付けた**コードの言語を選択**してください。共有先でも言語の情報は共有されます。
3. **「共有URL作成」ボタンを押してください**。共有のための設定画面が起動します。
4. **保存する期間をプルダウンから選択**してください。ちょっと共有すればいい場合は短い時間を、長い時間保存する必要がある場合は長い保存期間を選択してください。
5. **「送信」ボタンをクリック**してください。共有用のURLの作成が始まります。
6. 作成された共有URLを**クリップボードにコピーして、共有**してください。

`
